             CMD        PROMPT('Generar Biblioteca para Proy.')
             PARM       KWD(NROPED) TYPE(*CHAR) LEN(4) MIN(1) +
                          PROMPT('Numero de Redmine')
             PARM       KWD(LIB) TYPE(*CHAR) LEN(10) MIN(1) +
                          PROMPT('Nombre de la biblioteca')
