      /if defined(CEETREC_H)
      /eof
      /endif
      /define CEETREC_H

     D CEETREC         pr                  ExtProc('CEETREC')
     D  rc                           10i 0 const options(*omit)
     D  user_rc                      10i 0 const options(*omit)

