pgm

             ENDTCPSVR SERVER(*HTTP) HTTPSVR(WSREST)
             DLYJOB     DLY(10)
             STRTCPSVR SERVER(*HTTP) HTTPSVR(WSREST)

             ENDTCPSVR SERVER(*HTTP) HTTPSVR(QUOMWS02)
             DLYJOB     DLY(30)
             STRTCPSVR SERVER(*HTTP) HTTPSVR(QUOMWS02)

             ENDTCPSVR SERVER(*HTTP) HTTPSVR(QUOMWS01)
             DLYJOB     DLY(120)
             STRTCPSVR SERVER(*HTTP) HTTPSVR(QUOMWS01)

fin:
endpgm
