PGM

             OVRDBF     FILE(SET302) TOFILE(AXAREAL/SET302)
             OVRDBF     FILE(SET302C) TOFILE(AXAREAL/SET302C)
             OVRDBF     FILE(SET130) TOFILE(AXAREAL/SET130)

             CALL       PGM(INF1SERG/FECPROD)

             DLTOVR     FILE(*ALL)

ENDPGM
