PGM

      CALL PGM(TAATOOL/SPWLIBLC) PARM('P')
      RMVLIBLE LIB(DESATOOLS)
      MONMSG MSGID(CPF2110 CPF2104)
      ADDLIBLE LIB(DESATOOLS)
      MONMSG MSGID(CPF2103)

      CALL PGM(DESATOOLS/ADDCPAT1)

      /* ---------------------------------------------- */
      /* Copiar SET201                                  */
      /* ---------------------------------------------- */
      CLRPFM FILE(SET201)
      CALL PGM(GETT201)

      /* ---------------------------------------------- */
      /* Copiar SET202                                  */
      /* ---------------------------------------------- */
      CLRPFM FILE(SET202)
      CALL PGM(GETT202)

      /* ---------------------------------------------- */
      /* Copiar SET203                                  */
      /* ---------------------------------------------- */
      CLRPFM FILE(SET203)
      CALL PGM(GETT203)

      /* ---------------------------------------------- */
      /* Copiar SET204                                  */
      /* ---------------------------------------------- */
      CALL PGM(GETT204)

      /* ---------------------------------------------- */
      /* Copiar SET206                                  */
      /* ---------------------------------------------- */
      CALL PGM(GETT206)

      /* ---------------------------------------------- */
      /* Copiar SET207                                  */
      /* ---------------------------------------------- */
      CALL PGM(GETT207)

      /* ---------------------------------------------- */
      /* Copiar SET2071                                 */
      /* ---------------------------------------------- */
      CALL PGM(GETT2071)

      /* ---------------------------------------------- */
      /* Copiar SET209                                  */
      /* ---------------------------------------------- */
      CALL PGM(GETT209)

ENDPGM
