PGM

       CALL INFXSEGU/LBADDXC0

       ADDLIBLE   LIB(DESATOOLS) POSITION(*LAST)
       ADDLIBLE   LIB(RPGUNIT) POSITION(*LAST)

       ADDENVVAR QIBM_RPG_PCML_VERSION VALUE('6.0')
       MONMSG     MSGID(CPF0000)

ENDPGM
