PGM

       DCL VAR(&SYSNAME) TYPE(*CHAR) LEN(8)

       RTVNETA SYSNAME(&SYSNAME)

       CALL TAATOOL/SPWLIBLC PARM(P)

       IF COND(&SYSNAME = 'SOFTDESA') THEN(DO)
          CALL INF1SERG/PWRDWNR
       ENDDO

ENDPGM
