PGM

      DCL VAR(&PORC) TYPE(*DEC) LEN(5 2)
      DCL VAR(&SYSN) TYPE(*CHAR) LEN(8)

      RTVNETA SYSNAME(&SYSN)

      IF COND(&SYSN *NE 'POWER7') THEN(DO)
         CALL PGM(TAATOOL/SPWLIBLC) PARM('P')
         RMVLIBLE LIB(DESATOOLS)
         MONMSG MSGID(CPF2110 CPF2104)
         ADDLIBLE LIB(DESATOOLS)
         MONMSG MSGID(CPF2103)
      ENDDO

      CHGVAR VAR(&PORC) VALUE(20)

      CLRPFM FILE(RGZPF)
      CALL PGM(RGZ000)
      CALL PGM(RGZ001) PARM(&PORC)

ENDPGM
