PGM

DCL VAR(&SYSNAME) TYPE(*CHAR) LEN(8)
DCL VAR(&PEAUSU)  TYPE(*CHAR) LEN(10)

RTVNETA SYSNAME(&SYSNAME)
IF COND(&SYSNAME = 'POWER7') THEN(DO)
   RETURN
ENDDO

CHGDTAARA  DTAARA(AXAREAL/DTASPDWY2S (1 1)) VALUE('S')
CHGDTAARA  DTAARA(AXAREAL/DTAPDF01 (23 1)) VALUE('N')
CHGDTAARA  DTAARA(DTASMA01 (1 50)) VALUE('u01')
CHGDTAARA  DTAARA(DTASMA01 (51 50)) VALUE('password')
CHGDTAARA  DTAARA(DTASMA01 (101 50)) VALUE('srvdesa')

ENDPGM