PGM

DCL VAR(&SYSNAME) TYPE(*CHAR) LEN(8)
DCL VAR(&DATETIME) TYPE(*CHAR) LEN(20)

RTVNETA SYSNAME(&SYSNAME)
IF COND(&SYSNAME *NE 'SOFTTEST') THEN(DO)
   RETURN
ENDDO

RTVSYSVAL SYSVAL(QDATETIME) +
          RTNVAR(&DATETIME)
CHGDTAARA DTAARA(DESATOOLS/DTALSTRST (1 20)) +
          VALUE(&DATETIME)

ENDPGM