PGM

DCL VAR(&SYSNAME) TYPE(*CHAR) LEN(8)
DCL VAR(&PEAUSU)  TYPE(*CHAR) LEN(10)

RTVNETA SYSNAME(&SYSNAME)
IF COND(&SYSNAME = 'POWER7') THEN(DO)
   RETURN
ENDDO

STRTCPSVR  SERVER(*HTTP) HTTPSVR(WSREST)
STRTCPSVR  SERVER(*HTTP) HTTPSVR(QUOMWS01)
STRTCPSVR  SERVER(*HTTP) HTTPSVR(QUOMWS02)

ENDPGM