PGM

DCL VAR(&SYSNAME) TYPE(*CHAR) LEN(8)
DCL VAR(&PEAUSU)  TYPE(*CHAR) LEN(10)

RTVNETA SYSNAME(&SYSNAME)
IF COND(&SYSNAME = 'POWER7') THEN(DO)
   RETURN
ENDDO

CALL PGM(TAATOOL/SPWLIBLC) PARM(P)
RMVLIBLE LIB(DESATOOLS)
MONMSG MSGID(CPF2110 CPF2104)
ADDLIBLE LIB(DESATOOLS)
MONMSG MSGID(CPF2103)

ENDPGM