PGM PARM(&TRGTYPE)

DCL VAR(&SYSNAME) TYPE(*CHAR) LEN(8)
DCL VAR(&TRGTYPE)  TYPE(*CHAR) LEN(1)

RTVNETA SYSNAME(&SYSNAME)
IF COND(&SYSNAME = 'POWER7') THEN(DO)
   RETURN
ENDDO

CALL PGM(DESATOOLS/ADDCPAT1)
CALL PGM(RST100Q)
CALL PGM(RST170Q)
CALL PGM(RST160Q)

ENDPGM