PGM PARM(&LIB &OBJ &TYPE &ERRO)

    DCL VAR(&LIB) TYPE(*CHAR) LEN(10)
    DCL VAR(&OBJ) TYPE(*CHAR) LEN(10)
    DCL VAR(&TYPE) TYPE(*CHAR) LEN(10)
    DCL VAR(&ERRO) TYPE(*CHAR) LEN(1)

    GRTOBJAUT OBJ(&LIB/&OBJ) OBJTYPE(&TYPE) +
              USER(INF1PGM)  AUT(*USE)      + 
              REPLACE(*YES)

    CHGVAR VAR(&ERRO) VALUE('1')

ENDPGM