PGM PARM(&LIB &OBJ &TYPE &OWNER &ERRO)

    DCL VAR(&LIB) TYPE(*CHAR) LEN(10)
    DCL VAR(&OBJ) TYPE(*CHAR) LEN(10)
    DCL VAR(&TYPE) TYPE(*CHAR) LEN(10)
    DCL VAR(&OWNER) TYPE(*CHAR) LEN(10)
    DCL VAR(&ERRO) TYPE(*CHAR) LEN(1)

    CHGOBJOWN OBJ(&LIB/&OBJ) OBJTYPE(&TYPE) NEWOWN(&OWNER)

    CHGVAR VAR(&ERRO) VALUE('1')

ENDPGM