PGM PARM(&SYSN)

    DCL VAR(&SYSN) TYPE(*CHAR) LEN(10)
    DCL VAR(&SYSNAME) TYPE(*CHAR) LEN(8)

    RTVNETA SYSNAME(&SYSNAME)

    CHGVAR VAR(&SYSN) VALUE(&SYSNAME)

ENDPGM